#問1
#(1)
100 - sum(c(0.93, 5.25, 35.8, 38.27, 5.25, 0.62)) #13.88

#(2)
#度数分布表から中央値を求める
# -> 累積度数から50%が含まれる区間を特する
france<- c(0.93, 5.25, 35.80, 38.27, 13.88, 5.25, 0.62)
cumsum(france)
idx <- 1
for(is_upper50 in ifelse(cumsum(france) >= 50, TRUE, FALSE)){
  if(is_upper50) break
  idx <- idx + 1
}
idx #4

#(3)
barplot(c(7.48, 19.07, 50.28, 18.02, 2.41, 2.74, 0.00),
        names.arg = c('A', 'B', 'C', 'D', 'E', 'F', 'G'),
        ylab = "相対度数", xlab = "階級")

#問2
#(2)
#回帰係数のt値 = 回帰係数/標準誤差
# -> 標準誤差 = 回帰係数 / t値
-2.7608/(-9.0938)

#(3)
#回帰式の計算
20.0209 - 2.7608 * 6.10

#問3
#(1)
cabbage <- c(215, 256, 183, 154, 149, 174, 
             230, 356, 218, 242, 213, 180)
#中央値
median(cabbage) #214
#変動係数 = 標準偏差/平均
sd(cabbage)/mean(cabbage) #0.261

#問10
#(1)
p <- 1-pnorm(60, mean=50, sd=10)

#(2)
dbinom(1, 5, p)

#(2)
1-pnorm(2, mean=0, sd=10/sqrt(5))

#問11
#(1)
#ポアソン分布は、平均=分散=λ
#(2)
ppois(0, lambda = 518/365)

#問12
#(2)
#回帰係数βについて
#帰無仮説：β=-1, 対立仮説：β≠-1の統計検定量
#t = (β'-β0)/標準誤差
(-4.89615+1)/0.28922

#問13
#(1)
#母比率の95%信頼区間
#p± Zα√(p(1-p)/n)
p <- 0.483
d <- qnorm(0.975)*sqrt(p*(1-p)/1897)
c(p-d, p+d) 

#(2)
#母比率の差の95%信頼区間
#(p1-p2)± Zα√((p1(1-p1)/n1)+(p2(1-p2)/n2))
p1 <- 0.483
p2 <- 0.416
d<- qnorm(0.975)*sqrt(p1*(1-p1)/1897+p2*(1-p2)/1925)
c((p1-p2)-d, (p1-p2)+d)

#問15
#適合度の検定
#理論値からの実測値のズレを算出し、カイ二乗検定する
#カイ二乗値 = (実測値-理論値)^2/理論値
P <- c(0.2, 0.3, 0.5)
tv <- P*50
X2 <- (tv[1]-5)^2/tv[1]+(tv[2]-12)^2/tv[2]+(tv[3]-33)^2/tv[3] #5.66
1-pchisq(5.66, 2) #0.06->有意水準5%で棄却できない

#問16
#一元配置分散分析
#水準間平方和と残差平方和を算出し、F-検定する
#F = (水準間平方和/水準間自由度)/(残差平方和/残差自由度)
F <- (2785835/5)/(1556194/77) #27.568
1-pf(F, 5, 77) #6.661338e-16
